MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX270F512H.atdf
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0x7FFFFFFB">
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Program Flash Write-Protect bits" mask="0xffc00" name="PWP" values="DEVCFG0__PWP" />
            <bitfield caption="Boot Flash Write-Protect bit" mask="0x1000000" name="BWP" values="DEVCFG0__BWP" />
            <bitfield caption="Code-Protect bit" mask="0x10000000" name="CP" values="DEVCFG0__CP" />
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name="" />
      </value-group>
      <value-group caption="Peripheral Module Disable Configuration bit" name="DEVCFG3__PMDL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Configuration bit" name="DEVCFG3__IOL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB USBID Selection bit" name="DEVCFG3__FUSBIDIO">
         <value caption="USBID pin is controlled by the USB module" name="ON" value="0x1" />
         <value caption="USBID pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB VBUS_ON Selection bit" name="DEVCFG3__FVBUSONIO">
         <value caption="VBUSON pin is controlled by the USB module" name="ON" value="0x1" />
         <value caption="VBUSON pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="12x divider" name="DIV_12" value="0x7" />
         <value caption="10x divider" name="DIV_10" value="0x6" />
         <value caption="6x divider" name="DIV_6" value="0x5" />
         <value caption="5x divider" name="DIV_5" value="0x4" />
         <value caption="4x divider" name="DIV_4" value="0x3" />
         <value caption="3x divider" name="DIV_3" value="0x2" />
         <value caption="2x divider" name="DIV_2" value="0x1" />
         <value caption="1x divider" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="PLL Multiplier bits" name="DEVCFG2__FPLLMUL">
         <value caption="24x multiplier" name="MUL_24" value="0x7" />
         <value caption="21x multiplier" name="MUL_21" value="0x6" />
         <value caption="20x multiplier" name="MUL_20" value="0x5" />
         <value caption="19x multiplier" name="MUL_19" value="0x4" />
         <value caption="18x multiplier" name="MUL_18" value="0x3" />
         <value caption="17x multiplier" name="MUL_17" value="0x2" />
         <value caption="16x multiplier" name="MUL_16" value="0x1" />
         <value caption="15x multiplier" name="MUL_15" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Input Divider bits" name="DEVCFG2__UPLLIDIV">
         <value caption="12x divider" name="DIV_12" value="0x7" />
         <value caption="10x divider" name="DIV_10" value="0x6" />
         <value caption="6x divider" name="DIV_6" value="0x5" />
         <value caption="5x divider" name="DIV_5" value="0x4" />
         <value caption="4x divider" name="DIV_4" value="0x3" />
         <value caption="3x divider" name="DIV_3" value="0x2" />
         <value caption="2x divider" name="DIV_2" value="0x1" />
         <value caption="1x divider" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="System PLL Feedback Divider bits" name="DEVCFG2__UPLLEN">
         <value caption="Disable and bypass USB PLL" name="OFF" value="0x1" />
         <value caption="Enable USB PLL" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Default PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="256x divider" name="DIV_256" value="0x7" />
         <value caption="64x divider" name="DIV_64" value="0x6" />
         <value caption="32x divider" name="DIV_32" value="0x5" />
         <value caption="16x divider" name="DIV_16" value="0x4" />
         <value caption="8x divider" name="DIV_8" value="0x3" />
         <value caption="4x divider" name="DIV_4" value="0x2" />
         <value caption="2x divider" name="DIV_2" value="0x1" />
         <value caption="1x divider" name="DIV_1" value="0x0" />
      </value-group> 
      <value-group caption="Oscillator Selection bits" name="DEVCFG1__FNOSC">
         <value caption="Fast RC Oscillator with divide-by-N (FRCDIV)" name="FRCDIV" value="0x7" />
         <value caption="FRCDIV16 Fast RC Oscillator with fixed divide-by-16 postscaler" name="FRCDIV16" value="0x6" />
         <value caption="Low-Power RC Oscillator (LPRC)" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator (POSC) with PLL module (XT+PLL, HS+PLL, EC+PLL)" name="PRIPLL" value="0x3" />
         <value caption="Primary Oscillator (XT, HS, EC)" name="PRI" value="0x2" />
         <value caption="Fast RC Oscillator with divide-by-N with PLL module (FRCDIV+PLL)" name="FRCPLL" value="0x1" />
         <value caption="Fast RC Oscillator (FRC)" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="DEVCFG1__FSOSCEN">
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
      </value-group>      
      <value-group caption="Internal External Switchover bit" name="DEVCFG1__IESO">
         <value caption="Internal External Switchover mode is disabled (Two-Speed Start-up is disabled)" name="OFF" value="0x0" />
         <value caption="Internal External Switchover mode is enabled (Two-Speed Start-up is enabled)" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="DEVCFG1__POSCMOD">
         <value caption="Primary Oscillator disabled" name="OFF" value="0x3" />
         <value caption="HS Oscillator mode selected" name="HS" value="0x2" />
         <value caption="XT Oscillator mode selected" name="XT" value="0x1" />
         <value caption="External Clock mode selected" name="EC" value="0x0" />
      </value-group>
      <value-group caption="CLKO Enable Configuration bit" name="DEVCFG1__OSCIOFNC">
         <value caption="CLKO output is disabled" name="OFF" value="0x1" />
         <value caption="CLKO output signal active on the OSCO pin" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock Divisor Default Value bits" name="DEVCFG1__FPBDIV">
         <value caption="PBCLK is SYSCLK divided by 8" name="DIV_8" value="0x3" />
         <value caption="PBCLK is SYSCLK divided by 4" name="DIV_4" value="0x2" />
         <value caption="PBCLK is SYSCLK divided by 2" name="DIV_2" value="0x1" />
         <value caption="PBCLK is SYSCLK divided by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Clock Switching and Monitor Selection Configuration bits" name="DEVCFG1__FCKSM">
         <value caption="Clock switching is disabled, Fail-Safe Clock Monitor is disabled" name="CSDCMD" value="0x3" />
         
         <value caption="Clock switching is enabled, Fail-Safe Clock Monitor is disabled" name="CSECMD" value="0x1" />
         <value caption="Clock switching is enabled, Fail-Safe Clock Monitor is enabled" name="CSECME" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Postscale Select bits" name="DEVCFG1__WDTPS">
         <value caption="1:1048576" name="PS1048576" value="0x14" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:1" name="PS1" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="DEVCFG1__WINDIS">
         <value caption="Watchdog Timer is in non-Window mode" name="OFF" value="0x1" />
         <value caption="Watchdog Timer is in Window mode" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG1__FWDTEN">
         <value caption="Watchdog Timer is not enabled; it can be enabled in software" name="OFF" value="0x0" />
         <value caption="Watchdog Timer is enabled and cannot be disabled by software" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="DEVCFG1__FWDTWINSZ">
         <value caption="Window size is 25%" name="WINSZ_25" value="0x3" />
         <value caption="Window size is 37.5%" name="WINSZ_37" value="0x2" />
         <value caption="Window size is 50%" name="WINSZ_50" value="0x1" />
         <value caption="Window size is 75%" name="WINSZ_75" value="0x0" />
      </value-group>
      <value-group caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" name="DEVCFG0__DEBUG">
         <value caption="Debugger is disabled" name="OFF" value="0x0" />
         <value caption="Debugger is enabled" name="ON" value="0x3" />
      </value-group>
